CSI API ETABS v1
cDCoACI318_19 Interface
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
public interface cDCoACI318_19
Public Interface cDCoACI318_19
Dim instance As cDCoACI318_19
public interface class cDCoACI318_19
type cDCoACI318_19 =  interface end
The cDCoACI318_19 type exposes the following members.
Methods
Name | Description
GetOverwrite
 Retrieves the value of a concrete design overwrite item.
GetPreference
 Retrieves the value of a concrete design preference item.
SetOverwrite
 Sets the value of a concrete design overwrite item.
SetPreference
 Sets the value of a concrete design preference item.
Top
See Also
Reference
ETABSv1 Namespace